Repository: isabella232/anjuta-extras
Catalog: po/*.po
Languages: ro

source: Sample Plugin
ro: Modul demonstrativ

source: Sample Plugin for Anjuta.
ro: Modul demonstrativ pentru Anjuta.

source: Scintilla Editor
ro: Editor Scintilla

source: An alternate editor based on Scintilla
ro: Un editor de text alternativ bazat pe Scintilla

source: Arrows
ro: Săgeți

source: Squares
ro: Pătrate

source: Choose autocomplete for single match
ro: Alege completare auto pentru o potrivire singură

source: Autocomplete XML/HTML closing tags
ro: Completare auto pentru etichetele de închidere XML/HTML

source: Autocompletion pop up choices
ro: Alegeri contextuale ale completării automate

source: Autocompletion
ro: Completare automată

source: Enable code folding
ro: Activează plierea codului

source: Enable comments folding
ro: Activează plierea comentariilor

source: Enable Python comments folding
ro: Activează plierea comentariilor Python

source: Enable Python quoted strings folding
ro: Activează plierea șirurilor citate Python

source: Enable HTML tags folding
ro: Activează plierea etichetelor HTML

source: Compact folding
ro: Pliere compactă

source: Draw line below folded lines
ro: Trage o linie sub liniile pliate

source: Collapse all code folds on file open
ro: Restrânge toate plierile de cod la deschiderea fișierului

source: Fold style:
ro: Stil de pliere:

source: Code folding
ro: Pliere de cod

source: Disable syntax highlighting
ro: Dezactivează evidențierea sintaxei

source: Enable braces check
ro: Activează verificarea acoladelor

source: Strip trailing spaces on file save
ro: Eliminați spațiile de finalizare la salvarea fișierului

source: Filter extraneous characters in DOS mode
ro: Filtrează caracterele străine în modul DOS

source: Wrap bookmarks search around
ro: Încadrează căutarea de marcaje în jurul

source: Edge column
ro: Coloană de margine

source: Caret blink period in ms
ro: Perioada de clipire caret în ms

source: Editor caret (cursor) width in pixels
ro: Lățimea editorului caret-ului (cursorului) în pixeli

source: Line numbers margin width in pixels
ro: Lățimea marginii numerelor de linii în pixeli

source: Misc options
ro: Opțiuni misc

source: Colors & Fonts
ro: Culori & Fonturi

source: Enable automatic indentation
ro: Activează indentarea automată

source: Maintain past Indentation
ro: Menține indentarea anterioară

source: Pressing tab inserts indentation
ro: Apăsarea tab inserează indentare

source: Pressing backspace un-indents
ro: Apăsarea backspace dezindentează

source: Indent closing braces
ro: Indentează acoladele de închidere

source: Indent opening braces
ro: Indentează acoladele de deschidere

source: Use tabs for indentation
ro: Utilizează taburi pentru indentare

source: Indentation size in spaces:
ro: Dimensiunea indentării în spații:

source: Tab size in spaces:
ro: Dimensiunea tabului în spații:

source: Basic Indentation
ro: Indentare de bază

source: View EOL chars
ro: Vizualizează caractere EOL

source: View Indentation Guides
ro: Vizualizează ghidurile indentării

source: View Whitespaces
ro: Vizualizează spațiile albe

source: View indentation whitespaces
ro: Vizualizează spațiile albe ale indentării

source: View Line Wrap
ro: Vizualizează încadrarea liniei

source: Margin Linenum visible
ro: Numărul liniei marginii vizibil

source: Margin Marker visible
ro: Marcajul marginii vizibil

source: Margin Fold visible
ro: Plierea marginii vizibilă

source: Lines
ro: Linii

source: Add line number every:
ro: Adaugă un număr de linie la fiecare:

source: Enable line wrap
ro: Activează încadrarea liniei

source: Add page header
ro: Adaugă antetul paginii

source: Monochrome
ro: Monocrom

source: Colour
ro: Culoare

source: Mode:
ro: Mod:

source: Print options
ro: Opțiuni tipărire

source: Printing
ro: Tipărire

source: Fonts and colors for editor
ro: Fonturi și culori pentru editor

source: Select highlight style to edit:
ro: Selectează stilul de evidențiere de editat:

source: Bold
ro: Aldin

source: Underlined
ro: Subliniat

source: Use default
ro: Utilizează implicit

source: Background color:
ro: Culoare de fundal:

source: Foreground color:
ro: Culoare de prim plan:

source: Attributes:
ro: Atribute:

source: Highlight style
ro: Stil de evidențiere

source: Caret (cursor) color:
ro: Culoare caret (cursor):

source: Calltip background:
ro: Fundal de apel:

source: Selection background:
ro: Fundal de selecție:

source: Selection foreground:
ro: Prim plan de selecție:

source: Other colors
ro: Alte culori

source: _Line Number Margin
ro: Marginea numărului de _linie

source: Show/Hide line numbers
ro: Arată/Ascunde numerele de linie

source: _Marker Margin
ro: Marginea de _marcaj

source: Show/Hide marker margin
ro: Arată/Ascunde marginea de marcaj

source: _Code Fold Margin
ro: Marginea de pliere a _codului

source: Show/Hide code fold margin
ro: Arată/Ascunde marginea de pliere a codului

source: _Indentation Guides
ro: Ghiduri de _indentare

source: Show/Hide indentation guides
ro: Arată/Ascunde ghidurile de indentare

source: _White Space
ro: Spațiu _alb

source: Show/Hide white spaces
ro: Arată/Ascunde spațiile albe

source: _Line End Characters
ro: Caractere de sfârșit de _linie

source: Show/Hide line end characters
ro: Arată/Ascunde caracterele de sfârșit de linie

source: Line _Wrapping
ro: Î_ncadrare de linie

source: Enable/disable line wrapping
ro: Activează/Dezactivează încadrarea de linie

source: Editor view settings
ro: Configurări de vizualizare a editorului

source: File: %s
ro: Fișier: %s

source: Unable to get text buffer for printing
ro: Nu se poate obține zona de memorie tampon pentru textul de tipărit

source: No file to print!
ro: Niciun fișier de tipărit!

source: The file '%s' has been changed. Do you want to reload it?
ro: Fișierul „%s” a fost modificat. Doriți să îl reîncărcați?

source: The file '%s' has been changed. Do you want to lose your changes and reload it?
ro: Fișierul „%s” a fost modificat. Doriți să pierdeți modificările și să îl încărcați?

source: The file '%s' has been deleted. Do you confirm and close it?
ro: Fișierul „%s” a fost șters. Confirmați și închideți?

source: The file '%s' has been deleted. Do you want to lose your changes and close it?
ro: Fișierul „%s” a fost șters. Doriți să pierdeți modificările și să îl închideți?

source: Could not get file info
ro: Nu s-au putut obține informațiile despre fișier

source: This file is too big. Unable to allocate memory.
ro: Fișierul este prea mare. Nu se poate aloca memorie.

source: Could not open file
ro: Nu s-a putut deschide fișierul

source: Error while reading from file
ro: Eroare la citirea din fișier

source: The file does not look like a text file or the file encoding is not supported. Please check if the encoding of file is in the supported encodings list. If not, add it from the preferences.
ro: Fișierul nu pare a fi un fișier text sau codarea nu este suportată. Verificați dacă în lista de codări suportate se află și codarea fișierului. Dacă nu, adăugați-o din panoul de preferințe.

source: Loading file...
ro: Se încarcă fișierul...

source: Could not load file: %s Details: %s
ro: Nu s-a putut încărca fișierul :%s Detalii: %s

source: File loaded successfully
ro: Fișierul a fost încărcat cu succes

source: Saving file...
ro: Se salvează fișierul...

source: Could not save intermediate file %s: %s
ro: Nu s-a putut salva fișierul intermediar %s: %s

source: File saved successfully
ro: Fișierul a fost salvat cu succes

source: Cannot load Global defaults and configuration files: %s. This may result in improper behaviour or instabilities. Anjuta will fall back to built in (limited) settings
ro: Nu s-au putut încărca valorile implicite globale și fișierele de configurație: %s. Aceasta ar putea duce la un comportament greșit sau instabil. Anjuta va reveni la setările cu care a fost construit (limitate)

source: Change build commands to use scratchbox 1 or 2
ro: Schimbă comenzile de construire pentru folosirea scratchbox-urilor 1 sau 2

source: Scratchbox directory:
ro: Director Scratchbox:

source: Scratchbox version:
ro: Versiune Scratchbox:

source: Select Scratchbox Folder
ro: Selectați dosarul Scratchbox

source: Scratchbox target:
ro: Țintă Scratchbox:

source: Scratchbox Options
ro: Opțiuni Scratchbox

source: Program '%s' does not exists
ro: Programul „%s” nu există
